liuhuaxijun/pro07_STM32F405RGT6_bike/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define ST_DC_Pin GPIO_PIN_4
#define ST_DC_GPIO_Port GPIOA
#define ST_RES_Pin GPIO_PIN_6
#define ST_RES_GPIO_Port GPIOA
#define ST_CS_Pin GPIO_PIN_0
#define ST_CS_GPIO_Port GPIOB
#define ST_BLK_Pin GPIO_PIN_1
#define ST_BLK_GPIO_Port GPIOB
#define CTP_RES_Pin GPIO_PIN_12
#define CTP_RES_GPIO_Port GPIOB
#define CTP_INT_Pin GPIO_PIN_13
#define CTP_INT_GPIO_Port GPIOB
#define CTP_INT_EXTI_IRQn EXTI15_10_IRQn
#define PWR_EN_Pin GPIO_PIN_14
#define PWR_EN_GPIO_Port GPIOB
#define BAT_CHG_DET_Pin GPIO_PIN_15
#define BAT_CHG_DET_GPIO_Port GPIOB
#define SD_CD_Pin GPIO_PIN_8
#define SD_CD_GPIO_Port GPIOA
#define PWR_KEY_DEF_Pin GPIO_PIN_3
#define PWR_KEY_DEF_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
